ERP.belugaerp/src/Catalogs/ТоварныеКатегории/ТоварныеКатегории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварныеКатегории</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_Апелласьон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Бренд</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_БрендКУ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_БрендыКУ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Вкус</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_Вкусы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВПодарочнойУпаковке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Выбыл</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДегустационныеХарактеристики</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Добавлен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДоляСпирта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДоляСпиртаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КатегорияВладельца</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_КатегорияВладельца</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КатегорияМотивации</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_КатегорияМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Класс</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодНСИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_НаименованиеПоСертификатуАнг</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НаименованиеПоСертификатуРус</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НаЭкспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Объем</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_Объемы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Предшественник</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПромоНаборСобственнойСборки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_РегионПроисхождения</name>
    <type>
      <types>CatalogRef.бг_РегионыПроисхождения</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Рейтинги</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СкюМТ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_СкюМТ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СортовойСостав</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Состояние</name>
    <type>
      <types>EnumRef.бг_СостоянияТоварныхКатегорий</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Статус</name>
    <type>
      <types>CatalogRef.бг_СтатусыТоварныхКатегорий</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>бг_АнализыДляУдостоверенияОКачестве</name>
    <type>
      <types>CatalogRef.бг_ТиповыеАнализыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Вариативность</name>
    <type>
      <types>CatalogRef.бг_ВариативностьНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидОперацииНалогообложенияАкцизом</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Выбыл</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Добавлен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕК_СУМ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СУМ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодНоменклатурыSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КонтрагентПроизводитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НормативныйДокумент</name>
    <type>
      <types>CatalogRef.бг_НормативныеДокументыСертификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбменB2B</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОписаниеСоставаПродукта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновноеНаименование</name>
    <type>
      <types>CatalogRef.бг_ОсновныеНаименованияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Предшественник</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокГодности</name>
    <type>
      <types>CatalogRef.бг_ЕК_Номенклатура_СрокГодности</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокХраненияПробВЛабораторииМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтранаПроизводителя</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипИмпортныхССП</name>
    <type>
      <types>EnumRef.бг_ТипыИмпортныхССП</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипМарки</name>
    <type>
      <types>CatalogRef.бг_КлассификаторТиповМарок</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УсловияТранспортирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ФайлПиктограммы</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>бг_СпособыОбеспеченияПотребности</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбеспеченияПотребностей</name>
      <type>
        <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/ТоварныеКатегории/ObjectModule.bsl
#Область ОбработчикиСобытий

&Перед("ПриКопировании")
Процедура бг_ПриКопировании(ОбъектКопирования)
	
	бг_КодНСИ = ""; 
	бг_Добавлен = ТекущаяДатаСеанса();  
	бг_Выбыл = Дата(1, 1, 1);
	
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бг_ОбщегоНазначенияСервер.ПередЗаписьюСправочникаНСИ(Отказ, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(бг_КодНСИ) Тогда
		Максимальныйбг_КодНСИ = бг_ОбщегоНазначенияСервер.МаксимальноеЗначениеСтроковогоРеквизитаСправочника(Ссылка, "ТоварныеКатегории", "бг_КодНСИ");
		бг_КодНСИ = бг_ОбщегоНазначенияСервер.ИнкрементированнаяСтрока(
			Максимальныйбг_КодНСИ,
			Метаданные.Справочники.ТоварныеКатегории.Реквизиты.бг_КодНСИ.Тип.КвалификаторыСтроки.Длина);
	КонецЕсли;
	
	бг_ОбновитьДолиСписрта();
	
    бг_СинхронизироватьНоменклатуруКонтрагентовПоКодуSAPПередЗаписью();

КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура бг_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(бг_Класс, "Безалкогольный") <> Истина Тогда
		ПроверяемыеРеквизиты.Добавить("бг_ДоляСпирта");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(бг_Класс, "НеПроверятьОбъем") <> Истина Тогда
		
		ПроверяемыеРеквизиты.Добавить("бг_Объем");
		
	Иначе  
		
		Индекс = ПроверяемыеРеквизиты.Найти("бг_Вкус");
		
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура бг_ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бг_ОбновитьКлассОцифровкиSKU_MT();		
	
	бг_СинхронизироватьНоменклатуруКонтрагентовПоКодуSAPПриЗаписи();

КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура бг_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	
	Если ЭтоНовый() Тогда
		бг_Добавлен = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бг_ОбновитьДолиСписрта()
	
	Если ДополнительныеСвойства.Свойство("НеОбновлятьДолиСпирта")
		И ДополнительныеСвойства.НеОбновлятьДолиСпирта Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	МИНИМУМ(Номенклатура.Крепость / 100) КАК КрепостьМинимум,
	|	МАКСИМУМ(Номенклатура.Крепость / 100) КАК КрепостьМаксимум
	|ПОМЕСТИТЬ ИтоговыеДанные
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ТоварнаяКатегория = &ТоварнаяКатегория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговыеДанные.КрепостьМинимум КАК КрепостьМинимум,
	|	ИтоговыеДанные.КрепостьМаксимум КАК КрепостьМаксимум
	|ИЗ
	|	ИтоговыеДанные КАК ИтоговыеДанные
	|ГДЕ
	|	НЕ ИтоговыеДанные.КрепостьМинимум ЕСТЬ NULL";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТоварнаяКатегория", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		КрепостьМинимум = Выборка.КрепостьМинимум;
		КрепостьМаксимум = Выборка.КрепостьМаксимум;
	Иначе
		Возврат;
	КонецЕсли;
	
	бг_ДоляСпирта = КрепостьМинимум;
	бг_ДоляСпиртаДо = КрепостьМаксимум;
	
КонецПроцедуры

Процедура бг_ОбновитьКлассОцифровкиSKU_MT() 
	
	Если ЗначениеЗаполнено(бг_СкюМТ)
		И ЗначениеЗаполнено(бг_Класс)
		И Не ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(бг_СкюМТ, "КлассОцифровки"))
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(бг_СкюМТ, "КлассОцифровки") <>
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(бг_Класс, "КлассОцифровки") Тогда    
			
		SKU_MT_Объект = бг_СкюМТ.ПолучитьОбъект();
		SKU_MT_Объект.КлассОцифровки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(бг_Класс, "КлассОцифровки");
		SKU_MT_Объект.Записать();   
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура бг_СинхронизироватьНоменклатуруКонтрагентовПоКодуSAPПередЗаписью()

	Если ЭтоНовый() Тогда
		СтарыйКодНоменклатурыSAP = "";			
	Иначе	
	    СтарыйКодНоменклатурыSAP = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "бг_СкюМТ.КодНоменклатурыSAP");
		Если Не ЗначениеЗаполнено(СтарыйКодНоменклатурыSAP) Тогда
			СтарыйКодНоменклатурыSAP = "";
		КонецЕсли;
	КонецЕсли;	
	ДополнительныеСвойства.Вставить("СтарыйКодНоменклатурыSAP", СтарыйКодНоменклатурыSAP);

КонецПроцедуры

Процедура бг_СинхронизироватьНоменклатуруКонтрагентовПоКодуSAPПриЗаписи()
	
	Если ЗначениеЗаполнено(бг_СкюМТ) Тогда
		НовыйКодНоменклатурыSAP = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(бг_СкюМТ, "КодНоменклатурыSAP");	
		Если Не ЗначениеЗаполнено(НовыйКодНоменклатурыSAP) Тогда
			НовыйКодНоменклатурыSAP = "";
		КонецЕсли;
	Иначе	
	    НовыйКодНоменклатурыSAP = "";
	КонецЕсли;
	
	Если ДополнительныеСвойства.СтарыйКодНоменклатурыSAP <> НовыйКодНоменклатурыSAP Тогда
		бг_НоменклатураКонтрагентов.СинхронизироватьНоменклатуруКонтрагентовПоКодуSAP(Ссылка);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
